=^..^=
=^. Вас приветстует древнегреческий latex                           .^=
=^. Пока греки изучали latex, они полностью запутались              .^=
=^. поэтому нам теперь нужно помнить несколько правил               .^=
=^..^=
=^. 0  и самое важное! Программа пишется снизу вверх                .^=
=^. 1.                                                              .^=
=^. 2. В конце каждой операции нужно улыбнуться :)                  .^=
=^. 3. Для присваивания значения переменной ::=                     .^=
=^. 4. Для создания переменной используйте \Z \ni                   .^=
=^. 5. Для вывода переменной используйте \gravo                     .^=
=^. 6. if    это    \katarce ~condition~  \katapanma
               <=>  \katarce ~body~       \katapanma  :)            .^=
=^. 7. while это    \katarce ~condition~  \katapanma
              <?=?> \katarce ~body~       \katapanma  :)            .^=
=^. 8. Начало функции - \lemma                                      .^=
=^. 9. Конец  функции - \oed (oper edei deixai)                     .^=
=^. 10. Возвращаемое значение (: :)                                 .^=
=^. 11. Для вызова функции используйте :( ):                        .^=
=^. 12. Для перечисления переменных используйте >|<                 .^=
=^..^=
=^. В конце нужно пожелать богам программы всего хорошего!          .^=
=^..^=

\VCEGO_XOROSHEGO

    n ::= n :)

    n ::= :( Fib >|< n ): :)

    n ::= 8 :)

    \Z \ni n :)

\teornma

\oed
    (: tmp :)

    tmp ::= tmp + :( Fib >|< (k - 2) ): :) 
    tmp ::= tmp + :( Fib >|< (k - 1) ): :) 
    tmp ::= 0 :)

    \katarce
        k <= 2
    \katapanma

        <=>

    \katarce
        (: 1 :)
    \katapanma  :)


\lemma :( Fib >|< k ):
